<?php
//输出数字1-10
echo '输出数字1-10<br/>';
for($i=1;$i<=10;$i++){
	echo $i.'<br/>';
}

echo '<hr/>';


//输出数字10-1
echo '输出数字10-1<br/>';
for($i=10;$i>=1;$i--){
	echo $i.'<br/>';
}
echo "<hr/>";



//输出1,2,4,5
echo '输出1,2,4,5<br/>';
for($j=1;$j<=5;$j++){
	if($j==3){
		continue; //退出当次循环，进入下一次循环
	}
	echo $j.'<br/>';
}
echo "<hr/>";


//使用break退出当次循环
echo  '使用break退出当次循环<br/>';
for($i=1;$i<=5;$i++){
	if($i>3){
		break; //退出当前循环，循环结束
	}
	echo $i.'<br/>';
}
echo '<hr/>';

//输出1-10的奇数
echo "输出1-10的奇数<br/>";
for($i=1;$i<=10;$i++){
	if($i%2==1){
		echo $i.'<br/>';
	}
}
echo "<hr/>";


//输出1-10的奇数(方法二)
echo "输出1-10的奇数(方法二)<br/>";
for($i=1;$i<=10;$i+=2){
	echo $i.'<br/>';
}
echo "<hr/>";





//输出一个三行五列的表格
echo "输出一个三行五列的表格<br/><br/>";
echo "<table border='1' cellpadding='0' cellspacing='0' width=80%>";
  for($i=1;$i<=3;$i++){
  	echo "<tr>";
  	for ($j=0; $j < 5; $j++) { 
  		echo "<td>x</td>";
  	}
  	echo "</tr>";
  }
echo  "</table>";
echo "<hr/>";



//输出99乘法表
echo  '输出99乘法表<br/>';
echo "<table border='1' cellspacing='0' cellpadding='0'>";
for($i=1;$i<=9;$i++){
	echo "<tr>";
	for($j=1;$j<=$i;$j++){
		echo "<td>{$j}X{$i}=".($i*$j)."</td>";
	}
	echo "</tr>";
}
echo "</table>";
echo '<hr/>';


//百钱买百鸡练习题
/*百钱买百鸡的问题算是一套非常经典的不定方程的问题，题目很简单：公鸡5文钱一只，母鸡3文钱一只，小鸡3只一文钱，
 用100文钱买一百只鸡,其中公鸡，母鸡，小鸡都必须要有，问公鸡，母鸡，小鸡要买多少只刚好凑足100文钱。
*/
echo "百钱买百鸡练习题<br/>";
for($i=1;$i<=100;$i++){
	for($j=1;$j<=100;$j++){
		for($k=1;$k<=100;$k++){
			if($i+$j+$k==100&&5*$i+3*$j+1/3*$k==100&&$k%3==0){
				//公鸡母鸡小鸡数量相加为100只。公鸡母鸡小鸡数量乘以单价相加起来的总价格为100元。
				echo "公鸡：{$i},母鸡：{$j},小鸡:{$k};<br/>";
			}
		}
	}
}

echo "<hr/>";




//多个条件的表达式
echo "多个条件的for循环表达式<br/>";
echo "注意第二个表达式的最后一个条件决定循环是否执行，之前的条件会被忽略<br/>";
for ($i=2,$j=5; $i<6,$j<10;$i++,$j++) { 
	//第二个表达式的最后一个条件决定循环是否执行
	//在本题中$j<10会决定是否继续执行循环,$i<6会被忽略
   echo "TEST<br/>";
}
echo $i."<br/>".$j."<br/>";//$i=7;$j=10; 

echo"<hr/>";





//过桥问题
/*假设某人有100,000现金。
每经过一次路口需要进行一次交费。
交费规则为当他现金大于50,000时每次需要交5%如果现金小于等于50,000时每次交5,000。
请写一程序计算此人可以经过多少次这个{路口。*/

echo '计算过桥问题<br/>';
for($i=100000,$num=0;$i>5000;){
//当需要用到多个初始化条件时可以用到多条件语句。
  if($i>=50000){
  	$i*=0.95;
  }else{
  	$i-=2500;
  }
  $num++;
}
echo "可通过桥{$num}次<br/>";

echo "<hr/>";





//四位彩色验证码
echo '四位彩色验证码<br/>';
for($i=0;$i<=3;$i++){
	echo "<span style='color:rgb(".mt_rand(0,255).",".mt_rand(0,255).",".mt_rand(0,255).")'>".mt_rand(0,9)."</style>";
}

echo "<hr/>";
